src/Documents/ВозвратДенежныхСредствКонтрагенту/ВозвратДенежныхСредствКонтрагенту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВозвратДенежныхСредствКонтрагенту</name>
  <registerRecords>AccumulationRegister.ВозвращенныеДенежныеСредства</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Проекты</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаВзаиморасчетов</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаВозврата</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ВозвращенныеДенежныеСредства/ВозвращенныеДенежныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВозвращенныеДенежныеСредства</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВВалютеУчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПричинаВозврата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВалютаУчета</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ВозвратДенежныхСредствКонтрагенту/ObjectModule.bsl
//////////////////////////////////////////////////////////////////////////////////
//// РАЗДЕЛ ПРОЦЕДУР И ФУНКЦИЙ

// Обработка проведения документа.
// ................................................................................
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ВозвращенныеДенежныеСредства 
	Движения.ВозвращенныеДенежныеСредства.Записывать = Истина;
	Для Каждого ТекСтрокаПроекты Из Проекты Цикл
		Движение                      = Движения.ВозвращенныеДенежныеСредства.Добавить();
		Движение.Период               = Дата;
		Движение.Контрагент           = Контрагент;
		Движение.ВалютаВзаиморасчетов = ТекСтрокаПроекты.ВалютаВзаиморасчетов;
		Движение.ВалютаУчета          = Константы.ВалютаУчета.Получить();
		Движение.Проект               = ТекСтрокаПроекты.Проект;
		Движение.ПричинаВозврата      = ТекСтрокаПроекты.ПричинаВозврата;
		Движение.СуммаВзаиморасчетов  = ТекСтрокаПроекты.СуммаВзаиморасчетов;
		Движение.СуммаВВалютеУчета    = ТекСтрокаПроекты.СуммаВзаиморасчетов*УП_ОбщегоНазначения_Сервер.ПолучитьАктуальныйКурсВалюты(Дата, ТекСтрокаПроекты.ВалютаВзаиморасчетов);
	КонецЦикла;
	
КонецПроцедуры
